{
  "contactInfo": {
    "name": "Mayur Mehta",
    "phone": "+1 (571) 528-7448",
    "email": "mayurdmehta@gmail.com",
    "location": "Nashua, NH",
    "linkedin": "[LinkedIn Profile URL]"
  },
  "experience": [
    {
      "company": "Robert Half",
      "title": "Senior Business Systems Analyst",
      "dates": "Dec 2022 – Mar 2025",
      "projects": [
        {
          "id": "RH01",
          "title": "Data Governance & Standardization",
          "problem": "Global marketing teams operated in silos with inconsistent campaign tracking, making it impossible to get a clear view of performance across a $20M annual spend.",
          "actions": [
            "Owned the project end-to-end, from requirements gathering to platform configuration and stakeholder training.",
            "Created a single, holistic data standardization framework to unify all marketing teams.",
            "Configured the utm.io platform with the newly standardized parameters.",
            "Led the change management, training, and onboarding for over 200 marketing and product stakeholders."
          ],
          "outcomes": [
            { "metric": "150% adoption", "description": "Boosted adoption of the new data governance platform." },
            { "metric": "30% reduction", "description": "Reduced data inconsistencies in marketing reports." },
            { "metric": "$20M", "description": "Provided clear visibility into the performance of a $20M annual marketing spend." }
          ]
        },
        {
          "id": "RH02",
          "title": "Analytics Engagement Model",
          "problem": "The Global Marketing Analytics team lacked a formal intake process, causing analysts and engineers to spend more time chasing requirements than doing high-value work.",
          "actions": [
            "Partnered with PMO, business, and internal tech teams to establish a formal engagement model.",
            "Designed and automated a new intake process using Jira and Smartsheet.",
            "Took ownership of scoping all incoming requests and providing operational support to technical teams.",
            "Managed the entire workflow within a Kanban Agile framework."
          ],
          "outcomes": [
            { "metric": "2 weeks to 3 days", "description": "Reduced the request approval and review lifecycle." },
            { "metric": "Increased Efficiency", "description": "Freed up engineering resources from administrative tasks to focus on technical work." }
          ]
        },
        {
          "id": "RH03",
          "title": "AI Call Intelligence",
          "problem": "The business lacked visibility into field sales performance and customer sentiment from inbound calls.",
          "actions": [
            "Owned the end-to-end configuration and management of the Invoca call intelligence platform.",
            "Partnered with Invoca's data science team to co-develop and train proprietary NLP models.",
            "Established a rigorous testing process using confusion matrix analysis to measure model performance.",
            "Led the technical integration of Invoca data into internal reporting systems and external ad platforms (Google Ads)."
          ],
          "outcomes": [
            { "metric": "90% accuracy", "description": "Achieved and maintained 90% accuracy for call classification models." },
            { "metric": "10% improvement", "description": "Improved the accuracy of incoming cold leads data by 10%." },
            { "metric": "1000 leads", "description": "Accurately reflected approximately 1000 additional cold leads annually, significantly aiding executive data-driven decision making." }
          ]
        },
        {
          "id": "RH04",
          "title": "Analytics Operational Leadership",
          "problem": "A 40-person analytics team, divided into four verticals, faced conflicting priorities, resource overload, and project delays due to the lack of a central operational hub.",
          "actions": [
            "Stepped up as the primary operational point person for the entire 40-member team.",
            "Designed and rolled out a custom Smartsheet Kanban board with integrated Gantt charts and a roadmap view to provide real-time visibility.",
            "Implemented a weighted average prioritization framework to objectively rank requests based on urgency, impact, and effort.",
            "Convened biweekly sessions with vertical leads and executive leadership to align priorities, address resourcing challenges, and ensure strategic alignment with a $20M marketing budget."
          ],
          "outcomes": [
            { "metric": "30% efficiency", "description": "Increased the overall efficiency and throughput of the global analytics programs." },
            { "metric": "1 week reduction", "description": "Shortened the analytics request cycle time by an average of one week, reducing project delays." },
            { "metric": "Strategic Alignment", "description": "Tightly aligned team outputs with the strategic objectives tied to a $20M marketing investment." }
          ]
        },
        {
          "id": "RH05",
          "title": "Confluence SSO Migration",
          "problem": "An enterprise Atlassian migration created a disjointed user experience, forcing 200+ marketing stakeholders to manage two separate logins for Jira and Confluence.",
          "actions": [
            "Led and owned the entire project to migrate the standalone Confluence instance to the enterprise SSO environment.",
            "Managed all administrative aspects, including the complex migration of over 100GB of data.",
            "Meticulously planned and executed the migration to ensure zero disruption and no loss of permissions.",
            "Handled all training and onboarding for the 200+ affected stakeholders."
          ],
          "outcomes": [
            { "metric": "0 incidents", "description": "Completed the migration ahead of schedule with zero disruption to user access or permissions." },
            { "metric": "200+ users", "description": "Seamlessly transitioned over 200 users to a unified login system." }
          ]
        }
      ]
    },
    {
      "company": "LilacMosaic Technologies",
      "title": "Co-Founder / Lead Business Analyst",
      "dates": "Aug 2023 – Jan 2025",
      "projects": [
        {
          "id": "LM01",
          "title": "AI Event Platform Product Strategy",
          "problem": "Event planners lacked a single, integrated platform for end-to-end planning, visualization, and execution.",
          "actions": [
            "Drove the entire product discovery phase, conducting 15+ user interviews and 10+ surveys.",
            "Synthesized research into foundational product artifacts (personas, journey maps, JTBD).",
            "Translated validated hypotheses into user stories and functional requirements documents.",
            "Acted as the product leader, owning feature prioritization and the product roadmap."
          ],
          "outcomes": [
            { "metric": "Product Roadmap", "description": "Created the foundational product strategy and a clear, actionable roadmap from concept." },
            { "metric": "15+ interviews", "description": "Validated product direction through extensive user research." }
          ]
        },
        {
          "id": "LM02",
          "title": "GenAI Recommendation System",
          "problem": "The platform needed a key differentiating feature—an AI-powered design recommendation system—to be competitive.",
          "actions": [
            "Oversaw the successful technical integration of Hugging Face (GenAI) and Pinterest APIs.",
            "Drove technical discussions and maintained the project plan for the feature.",
            "Launched the feature to a select group of 10+ early adopter customers for feedback.",
            "Mentored junior team members and interns on Agile and continuous development best practices."
          ],
          "outcomes": [
            { "metric": "Feature Launch", "description": "Successfully launched a core, AI-driven design recommendation feature to beta." },
            { "metric": "10+ beta customers", "description": "Established a rapid feedback loop for continuous product improvement." }
          ]
        },
        {
          "id": "LM03",
          "title": "Agile Framework Implementation",
          "problem": "As a startup, the development environment was chaotic and requirements were constantly changing, hindering the ability to deliver value quickly.",
          "actions": [
            "Took the initiative to establish and implement an Agile (Scrum) framework from scratch.",
            "Acted as the team's Scrum Master and Agile coach.",
            "Introduced and facilitated all core Scrum ceremonies (sprint planning, stand-ups, retrospectives).",
            "Coached the team on using iterative development to embrace and adapt to change."
          ],
          "outcomes": [
            { "metric": "Increased Adaptability", "description": "Transformed a chaotic process into one that could thrive on fluid requirements." },
            { "metric": "Faster Delivery", "description": "Increased the speed and predictability of value delivery to customers." }
          ]
        },
        {
          "id": "LM04",
          "title": "Foundational Product & Market Strategy",
          "problem": "As a bootstrapped startup with limited runway, we faced the risk of building a product nobody wanted. It was critical to validate our core idea and define a viable market entry strategy before committing significant development resources.",
          "actions": [
            "Executed a multi-faceted discovery process, distilling insights from comprehensive market, user, and competitor analyses to identify a key gap in the market.",
            "Architected foundational product artifacts (user personas, journey maps) that served as the 'single source of truth' to align the engineering and business vision.",
            "Drove the strategic definition of our MVP by applying 'diverge and converge' frameworks to translate raw user research into a prioritized feature backlog.",
            "Recruited and established a 'first-adopter' program to create a rapid and continuous feedback loop for product validation."
          ],
          "outcomes": [
            { "metric": "Focused MVP Scope", "description": "Distilled a wide-ranging list of features and ideas into 4 focused, core feature modules essential for the MVP, preventing feature bloat and saving months of estimated development time." },
            { "metric": "40% Adopter Conversion", "description": "Achieved a 40% conversion rate from user interviews into active beta program participants, proving the identified customer problem was significant and resonant." },
            { "metric": "2 Letters of Intent (LOI)", "description": "Validated the business model and market demand by securing 2 Letters of Intent (LOI) from key early adopters before a single line of code was written." }
          ]
        }
      ]
    },
    {
      "company": "Akamai Technologies",
      "title": "Business Systems Analyst",
      "dates": "Sep 2019 – Dec 2022",
      "projects": [
        {
          "id": "AK01",
          "title": "Global Tax Automation Program",
          "problem": "Akamai's existing Oracle EBTax module was outdated and couldn't efficiently handle tax calculations for $1B in annual spend across 30+ global markets.",
          "actions": [
            "Led a 7-phase global program, managing the full SDLC for a 20+ member team.",
            "Learned and owned the configuration of the Thomson Reuters OneSource platform from scratch.",
            "Translated complex international tax laws into detailed BRDs, FRDs, and process flow diagrams.",
            "Managed the complex technical integration between Thomson Reuters and Oracle EBS R12.",
            "Acted as the primary bridge between technical and non-technical stakeholders during architecture discussions."
          ],
          "outcomes": [
            { "metric": "$4M", "description": "Delivered $4M in annual savings through operational and system efficiencies." },
            { "metric": "$1B", "description": "Modernized a critical financial process impacting $1B in annual spend." },
            { "metric": "30+", "description": "Successfully rolled out the new system across more than 30 global markets." }
          ]
        },
        {
          "id": "AK02",
          "title": "Expense & Compliance Automation",
          "problem": "An on-premise Oracle expense module was inefficient for a mobile workforce and lacked automated compliance checks for multi-million dollar travel spend.",
          "actions": [
            "Served as a key business analyst for a complex integration of SAP Concur, Amex, Oracle EBS, and the AppZen AI compliance engine.",
            "Partnered with internal stakeholders (Finance, Audit) and external SAP consultants to map requirements.",
            "Single-handedly owned the migration of 20+ operational reports from Oracle to Cognos BI, learning Cognos from scratch.",
            "Drove the integration of AppZen's ML tool to automate compliance checks, ensuring the entire program was SOX-compliant.",
            "Created comprehensive training materials and change management documents to onboard over 8,000 employees onto the new SAP Concur system."
          ],
          "outcomes": [
            { "metric": "99% automation", "description": "Automated 99% of manual expense report compliance checks." },
            { "metric": "20% improvement", "description": "Improved on-time expense reporting compliance." },
            { "metric": "20+", "description": "Successfully migrated and delivered over 20 critical BI reports on a new platform." },
            { "metric": "8,000+ employees", "description": "Successfully onboarded over 8,000 employees to a new enterprise-wide system." }
          ]
        },
        {
          "id": "AK03",
          "title": "Host-to-Host Payment Automation",
          "problem": "The process for transmitting payment instructions for $1B in annual vendor invoices was manual, slow, and lacked scalability.",
          "actions": [
            "Acted as the BA and PM, facilitating the entire SDLC for the automation program.",
            "Designed the host-to-host payment transmission process using XML files.",
            "Authored all detailed technical documentation (BRD, FRD, TDD, BR100) for Oracle EBS R12 configuration.",
            "Managed critical dependencies with external banking partners (Chase, Citi), including regulatory requirements and UAT.",
            "Ensured the system was designed for high availability."
          ],
          "outcomes": [
            { "metric": "$1B", "description": "Automated the payment transmission process for $1B in annual spend." },
            { "metric": "99.99% success", "description": "Delivered a robust and reliable system with a 99.99% successful payment completion rate." }
          ]
        },
        {
          "id": "AK04",
          "title": "Data-Driven Operational Management",
          "problem": "The Procure-to-Pay team needed to balance the delivery of critical, long-term projects with ongoing operational support and technical debt reduction.",
          "actions": [
            "Acted as the functional owner of the Procure-to-Pay modules within Oracle EBS R12.",
            "Used SQL to analyze operational data and provide objective evidence for prioritization.",
            "Created automated Tableau dashboards to give leadership real-time visibility into project and operational health.",
            "Partnered with DevOps on root cause analysis to identify and prioritize critical technical debt."
          ],
          "outcomes": [
            { "metric": "25% efficiency", "description": "Increased cross-functional operational efficiency through data-driven prioritization." },
            { "metric": "Improved Stability", "description": "Enabled the successful, simultaneous delivery of multiple large-scale projects while maintaining operational stability." }
          ]
        },
        {
          "id": "AK05",
          "title": "Centralized Project Portfolio Management",
          "problem": "A dynamic portfolio of over 120 projects lacked a centralized tracking system, leading to resource conflicts, unresolved bottlenecks, and project delays.",
          "actions": [
            "Took the initiative to overhaul the project management process from the ground up.",
            "Implemented a centralized Smartsheet tracker, built detailed Gantt charts, and designed a resource allocation dashboard for leadership visibility.",
            "Facilitated structured weekly meetings with 20+ stakeholders to proactively surface and resolve interdependencies.",
            "Automated status reporting to consolidate project data and eliminate manual updates."
          ],
          "outcomes": [
            { "metric": "90% on-time delivery", "description": "Achieved a 90% on-time delivery rate for a portfolio of over 120 projects." },
            { "metric": "20 hours/week saved", "description": "Saved the team 20 hours each week by automating manual status reporting." },
            { "metric": "~100 issues resolved", "description": "Proactively resolved approximately 100 critical resource conflicts and bottlenecks annually." }
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "institution": "Northeastern University",
      "degree": "Master of Science, Engineering Management",
      "gpa": "3.9"
    },
    {
      "institution": "University of Mumbai",
      "degree": "Bachelor of Science, Computer Science"
    }
  ],
  "certifications": [
    {
      "name": "Certified Scrum Master (CSM)",
      "issuer": "Scrum Alliance",
      "status": "Completed: Apr 2025"
    },
    {
      "name": "AWS Certified Cloud Practitioner",
      "issuer": "AWS",
      "status": "In Progress, Expected: Jul 2025"
    },
    {
      "name": "Project Management Professional (PMP)",
      "issuer": "PMI",
      "status": "In Progress, Expected: Aug 2025"
    }
  ]
}
