{
  "contactInfo": {
    "name": "Mayur Mehta",
    "phone": "+1 (571) 528-7448",
    "email": "mayurdmehta@gmail.com",
    "location": "Nashua, NH",
    "linkedin": "[LinkedIn Profile URL]"
  },
  "technicalSkills": {
    "Methodologies": ["Agile (Scrum/Kanban)", "Waterfall", "SDLC", "Change Management"],
    "Analytics & AI/ML": ["SQL", "Domo", "NLP Model Tuning", "Data Governance"],
    "Cloud & Platforms": ["AWS", "SAP Concur", "Oracle EBS R12", "Invoca", "Hubspot", "Mailchimp"],
    "Project Management & Collaboration": ["Jira", "Smartsheet", "Confluence", "Notion", "Miro", "Visio", "Lucid Chart", "MS Project"],
    "Integrations & Automation": ["REST APIs", "XML", "SFTP", "Jira Automation Rules", "Smartsheet Automation", "Hubspot Automation", "Zapier"],
    "BI & Visualization": ["Tableau", "Cognos Report Studio"],
    "Development & SCM": ["GitHub", "GitHub Actions"]
  },
  "experience": [
    {
      "company": "Robert Half",
      "title": "Senior Business Systems Analyst",
      "dates": "Dec 2022 – Mar 2025",
      "projects": [
        {
          "id": "RH01",
          "title": "Data Governance & Standardization",
          "problem": "Siloed global marketing teams produced unstructured data, compromising the BI products used by leadership to oversee a $20M annual spend.",
          "actions": [
            "Partnered with marketing stakeholders to map existing workflows and define a new, holistic standardization framework.",
            "Configured the framework in the utm.io platform.",
            "Used Domo and SQL for data-backed analysis to facilitate new processes and keep leadership informed.",
            "Led change management for 200+ stakeholders, developing training materials in SharePoint and managing the project with Jira and Smartsheet."
          ],
          "outcomes": [
            { "metric": "150% adoption", "description": "Boosted platform adoption." },
            { "metric": "30% reduction", "description": "Cut data inconsistencies in marketing reports." }
          ]
        },
        {
          "id": "RH02",
          "title": "Analytics Engagement Model",
          "problem": "The Global Marketing Analytics team lacked a formal intake process, causing operational bottlenecks.",
          "actions": [
            "Designed and automated a new engagement model by integrating Jira and Smartsheet with advanced automation rules and formulas.",
            "Took ownership of the new workflow to manage intake and stakeholder communication."
          ],
          "outcomes": [
            { "metric": "2 weeks to 3 days", "description": "Dramatically reduced the request approval lifecycle." },
            { "metric": "Increased Efficiency", "description": "Freed up valuable engineering resources to focus on high-impact work." }
          ]
        },
        {
          "id": "RH03",
          "title": "AI Call Intelligence Platform Enhancement",
          "problem": "Call classification models were underperforming at only 65% accuracy, limiting data trust and actionable insights.",
          "actions": [
            "Acted as the technical program manager, partnering with Invoca's data science team to ensure new NLP models met Robert Half's requirements.",
            "Conducted rigorous testing and analysis using SQL and Domo, leading to key recommendations for improvement.",
            "Became the go-to subject matter expert, creating comprehensive documentation in Confluence and SharePoint."
          ],
          "outcomes": [
            { "metric": "65% to 90%", "description": "Increased model accuracy from 65% to 90%." },
            { "metric": "10% improvement", "description": "Improved cold lead classification by 10%, surfacing ~1,000 more qualified leads annually." },
            { "metric": "Enhanced Visibility", "description": "Attributed leads to marketing efforts in closed-loop reporting, enhancing visibility for marketing teams." }
          ]
        },
        {
          "id": "RH04",
          "title": "Analytics Operational Leadership",
          "problem": "A 40-person analytics team struggled with conflicting priorities and project delays.",
          "actions": [
            "Stepped up as the operational leader, designing a custom Smartsheet Kanban board integrated with Jira for real-time visibility.",
            "Implemented a weighted average prioritization framework to align work with a $20M marketing investment.",
            "Led biweekly alignment sessions with leadership to manage resources and priorities."
          ],
          "outcomes": [
            { "metric": "30% efficiency", "description": "Increased the team's overall efficiency and throughput." },
            { "metric": "1 week reduction", "description": "Shortened the request cycle time by an average of one week." }
          ]
        },
        {
          "id": "RH05",
          "title": "Confluence SSO Migration",
          "problem": "A disjointed user experience required 200+ marketing stakeholders to manage separate logins for Jira and Confluence.",
          "actions": [
            "Led the migration of a standalone Confluence instance into the enterprise Microsoft Active Directory SSO environment.",
            "Used Atlassian's native migration tools to meticulously plan and execute the transfer of over 100GB of data."
          ],
          "outcomes": [
            { "metric": "0 incidents", "description": "Completed the migration with zero disruption to user access or permissions." }
          ]
        },
        {
          "id": "RH06",
          "title": "Automated Call Routing System",
          "problem": "Inbound callers faced a lengthy and inefficient process to connect with the correct field representative.",
          "actions": [
            "Partnered with internal data engineering teams to design and implement an automated call routing system.",
            "Leveraged the Invoca API to build logic that connected callers to the nearest branch based on their caller ID or location input."
          ],
          "outcomes": [
            { "metric": "90% reduction", "description": "Reduced the number of prompts required to connect to a representative by 90%." },
            { "metric": "600,000+ calls", "description": "Significantly enhanced the customer experience for more than 600,000 annual calls." }
          ]
        }
      ]
    },
    {
      "company": "LilacMosaic Technologies",
      "title": "Co-Founder / Lead Business Analyst",
      "dates": "Aug 2023 – Jan 2025",
      "projects": [
        {
          "id": "LM01",
          "title": "AI Event Platform Product Strategy",
          "problem": "Event planners lacked a single, integrated platform for end-to-end planning, visualization, and execution.",
          "actions": [
            "Led the entire discovery phase, conducting user research with Google Forms, Survey Monkey, and Mailchimp.",
            "Synthesized research into product artifacts in Miro and managed the roadmap in Jira.",
            "Established Hubspot as the central CRM and automated the email journey for lead nurturing."
          ],
          "outcomes": [
            { "metric": "Product Roadmap", "description": "Created the foundational product strategy and a clear, actionable roadmap from concept." }
          ]
        },
        {
          "id": "LM02",
          "title": "GenAI Recommendation System",
          "problem": "The platform needed a key market differentiator to be competitive.",
          "actions": [
            "Oversaw the technical integration of Hugging Face (GenAI) and Pinterest APIs to build an AI-powered design recommendation system.",
            "Managed the entire project—from technical discussions to the early-adopter feedback loop—using Notion as a centralized hub."
          ],
          "outcomes": [
            { "metric": "Feature Launch", "description": "Successfully launched a core, AI-driven design recommendation feature to beta." }
          ]
        },
        {
          "id": "LM03",
          "title": "Agile Framework Implementation",
          "problem": "A chaotic startup development environment hindered the ability to deliver value quickly.",
          "actions": [
            "Established a formal Agile (Scrum) framework from the ground up, acting as the team's Scrum Master.",
            "Used Jira to build project boards and manage backlogs, integrating it with GitHub for CI/CD."
          ],
          "outcomes": [
            { "metric": "Increased Predictability", "description": "Significantly increased the speed and predictability of value delivery." }
          ]
        },
        {
          "id": "LM04",
          "title": "Foundational Product & Market Strategy",
          "problem": "The bootstrapped startup needed to validate its core idea and market entry strategy to de-risk development.",
          "actions": [
            "Architected foundational product artifacts in Miro and managed the first-adopter program in Hubspot, with Zapier automating communication.",
            "Your data-driven approach led to a 40% conversion rate from interviews to beta users."
          ],
          "outcomes": [
            { "metric": "2 Letters of Intent", "description": "Validated the business model by securing two Letters of Intent before a single line of code was written." }
          ]
        }
      ]
    },
    {
      "company": "Akamai Technologies",
      "title": "Business Systems Analyst",
      "dates": "Sep 2019 – Dec 2022",
      "projects": [
        {
          "id": "AK01",
          "title": "Global Tax Automation Program",
          "problem": "An outdated Oracle EBTax module couldn't efficiently handle tax calculations for $1B in annual spend.",
          "actions": [
            "Led a 7-phase global program, managing a 20+ member team using Jira, MS Project, and Smartsheet.",
            "Created all technical documentation in Confluence, Visio, and Lucid Chart.",
            "Personally owned the configuration of the Thomson Reuters OneSource platform and partnered with development teams for its API integration with Oracle EBS R12."
          ],
          "outcomes": [
            { "metric": "$4M in savings", "description": "Delivered $4M in savings." },
            { "metric": "30+ markets", "description": "Successfully rolled out the new system across more than 30 global markets." }
          ]
        },
        {
          "id": "AK02",
          "title": "Expense & Compliance Automation",
          "problem": "An on-premise Oracle expense module was inefficient and lacked automated compliance checks.",
          "actions": [
            "Configured rules-based automation in SAP Concur and the AppZen AI engine.",
            "Managed the API integration between Concur and Oracle EBS R12.",
            "Single-handedly extracted data from Oracle using SQL and built over 20 new reports in Cognos Report Studio.",
            "Developed the change management plan to successfully onboard over 8,000 employees."
          ],
          "outcomes": [
            { "metric": "99% automation", "description": "Automated 99% of manual expense report compliance checks." }
          ]
        },
        {
          "id": "AK03",
          "title": "Host-to-Host Payment Automation",
          "problem": "The manual process for transmitting payment instructions for $1B in annual spend was slow and unscalable.",
          "actions": [
            "Partnered with the development team to architect a host-to-host payment system using XML files over a secure SFTP pipeline.",
            "Built a failover mechanism into the XML files that integrated with the Oracle EBS Payments module to automatically handle failed payments."
          ],
          "outcomes": [
            { "metric": "99.99% success", "description": "Achieved a 99.99% successful payment completion rate." }
          ]
        },
        {
          "id": "AK04",
          "title": "Data-Driven Operational Management",
          "problem": "The Procure-to-Pay team needed to balance long-term projects with ongoing operational support.",
          "actions": [
            "Used SQL to query the Oracle DB and provide data-driven evidence for prioritization.",
            "Built automated Tableau dashboards to give leadership real-time visibility into operational health."
          ],
          "outcomes": [
            { "metric": "Improved Stability", "description": "Enabled the successful, simultaneous delivery of multiple large-scale projects while maintaining operational stability." }
          ]
        },
        {
          "id": "AK05",
          "title": "Centralized Project Portfolio Management",
          "problem": "A portfolio of over 120 projects lacked a centralized system, leading to resource conflicts and delays.",
          "actions": [
            "Took the initiative to build a centralized system from the ground up, implementing a Smartsheet tracker with Gantt charts and a resource dashboard.",
            "Automated status reporting and led structured weekly meetings with 20+ stakeholders."
          ],
          "outcomes": [
            { "metric": "90% on-time delivery", "description": "Achieved an impressive 90% on-time delivery rate." },
            { "metric": "20 hours/week saved", "description": "Saved the team 20 hours of manual work each week." }
          ]
        }
      ]
    }
  ],
  "education": [
    {
      "institution": "Northeastern University",
      "degree": "Master of Science, Engineering Management",
      "gpa": "3.9"
    },
    {
      "institution": "University of Mumbai",
      "degree": "Bachelor of Science, Computer Science"
    }
  ],
  "certifications": [
    {
      "name": "Certified Scrum Master (CSM)",
      "issuer": "Scrum Alliance",
      "status": "Completed: Apr 2025"
    },
    {
      "name": "AWS Certified Cloud Practitioner",
      "issuer": "AWS",
      "status": "In Progress, Expected: Jul 2025"
    },
    {
      "name": "Project Management Professional (PMP)",
      "issuer": "PMI",
      "status": "In Progress, Expected: Aug 2025"
    }
  ]
}
